## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:25" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:25" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 25 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "bed4d5a2b5cfd7c00555d667b7a17229-6" -> "4b91fa9e409ffd06ccfc0dbf49c7db5b"
        id                     = "graphql.4b91fa9e409ffd06ccfc0dbf49c7db5b.zip"
        tags                   = {}
      ~ version_id             = ".dnpCtcreW_sXwur5oXBvBXVw6G5ebeW" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "03aefa80db1bcb17b9d10f08f51aa76e" -> "65064c9f70e63d9402e3276a15a3368f"
        id                     = "dist/200.html"
      ~ source_hash            = "03aefa80db1bcb17b9d10f08f51aa76e" -> "65064c9f70e63d9402e3276a15a3368f"
        tags                   = {}
      ~ version_id             = "TYeVkJ1zkYlZ13fugH5NfMsSXkt1vtsv" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d168fb968a3913d64043bbbf138c80d1" -> "7ecf8d5bd9b5293418a0dca5dfa9eddc"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "d168fb968a3913d64043bbbf138c80d1" -> "7ecf8d5bd9b5293418a0dca5dfa9eddc"
        tags                   = {}
      ~ version_id             = "6t10DPz0SrsV5coW7PVMxRur3ubeOvRc" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "585223a99fca960e010e98b87bd8a09f" -> "5fb078422b21835c832c3f7bd61c9707"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "585223a99fca960e010e98b87bd8a09f" -> "5fb078422b21835c832c3f7bd61c9707"
        tags                   = {}
      ~ version_id             = "gwSKoIX6ywhhppvN3XGhtDQYP1Xgg4Pb" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "03aefa80db1bcb17b9d10f08f51aa76e" -> "65064c9f70e63d9402e3276a15a3368f"
        id                     = "dist/index.html"
      ~ source_hash            = "03aefa80db1bcb17b9d10f08f51aa76e" -> "65064c9f70e63d9402e3276a15a3368f"
        tags                   = {}
      ~ version_id             = "Dzf7QxArKfa62k79rUNyOxjGSdZSXOSt" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.472d7c09.js"] will be destroyed
  # (because key ["static/js/app.472d7c09.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "42da2174fda4cbf8e43f10c93533f607" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.472d7c09.js" -> null
-       key                    = "dist/static/js/app.472d7c09.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.472d7c09.js" -> null
-       source_hash            = "42da2174fda4cbf8e43f10c93533f607" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "ItylmEIgXAxGpEzHURB.mlZ8TsFVAmn." -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.472d7c09.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.472d7c09.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "87a9665bd7dc055da17c5f387451bb5d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.472d7c09.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.472d7c09.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.472d7c09.js.LICENSE.txt" -> null
-       source_hash            = "87a9665bd7dc055da17c5f387451bb5d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "YuGYviGbCNcQZuFLWhGtN8h2azgAje48" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.90865b04.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "7d16fd17cbdc39375332d03ae724e3fe"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.90865b04.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.90865b04.js"
+       source_hash            = "7d16fd17cbdc39375332d03ae724e3fe"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.90865b04.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "87a9665bd7dc055da17c5f387451bb5d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.90865b04.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.90865b04.js.LICENSE.txt"
+       source_hash            = "87a9665bd7dc055da17c5f387451bb5d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:41" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:41/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "41" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "d26a07b536b8d712359c637f75e595db7ed9ebbc" -> "9d9e287cfd180bdd6ba626d597119b835ec9be41"
              ~ "DD_TAGS"                            = "git.commit.sha:d26a07b536b8d712359c637f75e595db7ed9ebbc,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:9d9e287cfd180bdd6ba626d597119b835ec9be41,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "d26a07b536b8d712359c637f75e595db7ed9ebbc" -> "9d9e287cfd180bdd6ba626d597119b835ec9be41"
                # (15 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "41" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 4 to add, 7 to change, 4 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7283265668)*